RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G43x_Firmware_Library/n32g43x_usbfs_driver/inc/usb_regs.h
/* STAT_TX[1:0] STATus for TX transfer */
#define EP_TX_DIS       (0x0000) /* EndPoint TX DISabled */
#define EP_TX_STALL     (0x0010) /* EndPoint TX STALLed */
#define EP_TX_NAK       (0x0020) /* EndPoint TX NAKed */
#define EP_TX_VALID     (0x0030) /* EndPoint TX VALID */
#define EPTX_DATTOG1    (0x0010) /* EndPoint TX Data TOGgle bit1 */
#define EPTX_DATTOG2    (0x0020) /* EndPoint TX Data TOGgle bit2 */
#define EPTX_DATTOGMASK (EPTX_STS | EPREG_MASK)

/* STAT_RX[1:0] STATus for RX transfer */
#define EP_RX_DIS       (0x0000) /* EndPoint RX DISabled */
#define EP_RX_STALL     (0x1000) /* EndPoint RX STALLed */
#define EP_RX_NAK       (0x2000) /* EndPoint RX NAKed */
#define EP_RX_VALID     (0x3000) /* EndPoint RX VALID */
#define EPRX_DATTOG1    (0x1000) /* EndPoint RX Data TOGgle bit1 */
#define EPRX_DATTOG2    (0x2000) /* EndPoint RX Data TOGgle bit1 */
#define EPRX_DATTOGMASK (EPRX_STS | EPREG_MASK)

/* USB_SetCtrl */
#define _SetCNTR(wRegValue) (*USB_CTRL = (uint16_t)wRegValue)

/* USB_SetSts */
#define _SetISTR(wRegValue) (*USB_STS = (uint16_t)wRegValue)

/* USB_SetAddr */
#define _SetDADDR(wRegValue) (*USB_ADDR = (uint16_t)wRegValue)

/* USB_SetBuftab */
#define _SetBTABLE(wRegValue) (*USB_BUFTAB = (uint16_t)(wRegValue & 0xFFF8))

/* USB_GetCtrl */
#define _GetCNTR() ((uint16_t)*USB_CTRL)

/* USB_GetSts */
#define _GetISTR() ((uint16_t)*USB_STS)

/* USB_GetFn */
#define _GetFNR() ((uint16_t)*USB_FN)

/* USB_GetAddr */
#define _GetDADDR() ((uint16_t)*USB_ADDR)

/* USB_GetBTABLE */
#define _GetBTABLE() ((uint16_t)*USB_BUFTAB)

/* USB_SetEndPoint */
#define _SetENDPOINT(bEpNum, wRegValue) (*(EP0REG + bEpNum) = (uint16_t)wRegValue)

/* USB_GetEndPoint */
#define _GetENDPOINT(bEpNum) ((uint16_t)(*(EP0REG + bEpNum)))

/*******************************************************************************
 * Macro Name     : USB_SetEpType
 * Description    : sets the type in the endpoint register(bits EP_TYPE[1:0])
 * Input          : bEpNum: Endpoint Number.
 *                  wType
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPType(bEpNum, wType) (_SetENDPOINT(bEpNum, ((_GetENDPOINT(bEpNum) & EP_T_MASK) | wType)))

/*******************************************************************************
 * Macro Name     : USB_GetEpType
 * Description    : gets the type in the endpoint register(bits EP_TYPE[1:0])
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : Endpoint Type
 *******************************************************************************/
#define _GetEPType(bEpNum) (_GetENDPOINT(bEpNum) & EP_T_FIELD)

/*******************************************************************************
 * Macro Name     : SetEPTxStatus
 * Description    : sets the status for tx transfer (bits STAT_TX[1:0]).
 * Input          : bEpNum: Endpoint Number.
 *                  wState: new state
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPTxStatus(bEpNum, wState)                                                                                 \
    {                                                                                                                  \
        register uint16_t _wRegVal;                                                                                    \
        _wRegVal = _GetENDPOINT(bEpNum) & EPTX_DATTOGMASK;                                                             \
        /* toggle first bit ? */                                                                                       \
        if ((EPTX_DATTOG1 & wState) != 0)                                                                              \
            _wRegVal ^= EPTX_DATTOG1;                                                                                  \
        /* toggle second bit ?  */                                                                                     \
        if ((EPTX_DATTOG2 & wState) != 0)                                                                              \
            _wRegVal ^= EPTX_DATTOG2;                                                                                  \
        _SetENDPOINT(bEpNum, (_wRegVal | EP_CTRS_RX | EP_CTRS_TX));                                                    \
    } /* _SetEPTxStatus */

/*******************************************************************************
 * Macro Name     : SetEPRxStatus
 * Description    : sets the status for rx transfer (bits STAT_TX[1:0])
 * Input          : bEpNum: Endpoint Number.
 *                  wState: new state.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPRxStatus(bEpNum, wState)                                                                                 \
    {                                                                                                                  \
        register uint16_t _wRegVal;                                                                                    \
                                                                                                                       \
        _wRegVal = _GetENDPOINT(bEpNum) & EPRX_DATTOGMASK;                                                             \
        /* toggle first bit ? */                                                                                       \
        if ((EPRX_DATTOG1 & wState) != 0)                                                                              \
            _wRegVal ^= EPRX_DATTOG1;                                                                                  \
        /* toggle second bit ? */                                                                                      \
        if ((EPRX_DATTOG2 & wState) != 0)                                                                              \
            _wRegVal ^= EPRX_DATTOG2;                                                                                  \
        _SetENDPOINT(bEpNum, (_wRegVal | EP_CTRS_RX | EP_CTRS_TX));                                                    \
    } /* _SetEPRxStatus */

